ghi-electronics/TinyCLR-Ports/Targets/STM32F4/STM32F4_UsbClient.cpp
    return TinyCLR_Result::Success;
}

static TinyCLR_UsbClient_Provider usbClientProvider;
static TinyCLR_Api_Info usbClientApi;

void STM32F4_UsbClient_Reset() {
    for (auto controller = 0; controller < usbClientApi.Count; controller++) {
        // Close all stream if any opened
        for (auto stream = 0; stream < STM32F4_USB_QUEUE_SIZE; stream++) {
            UsbClient_Driver::CloseStream(controller, stream);
        }

        // Close controller
        UsbClient_Driver::Uninitialize(controller);
    }
}

const TinyCLR_Api_Info* STM32F4_UsbClient_GetApi() {
    usbClientProvider.Parent = &usbClientApi;
    usbClientProvider.Index = 0;
    usbClientProvider.Acquire = &STM32F4_UsbClient_Acquire;
    usbClientProvider.Release = &STM32F4_UsbClient_Release;
    usbClientProvider.Open = &STM32F4_UsbClient_Open;
    usbClientProvider.Close = &STM32F4_UsbClient_Close;
    usbClientProvider.Write = &STM32F4_UsbClient_Write;
    usbClientProvider.Read = &STM32F4_UsbClient_Read;
    usbClientProvider.Flush = &STM32F4_UsbClient_Flush;
    usbClientProvider.SetDeviceDescriptor = &STM32F4_UsbClient_SetDeviceDescriptor;
    usbClientProvider.SetConfigDescriptor = &STM32F4_UsbClient_SetConfigDescriptor;
    usbClientProvider.SetStringDescriptor = &STM32F4_UsbClient_SetStringDescriptor;
    usbClientProvider.SetDataReceivedHandler = &STM32F4_UsbClient_SetDataReceivedHandler;
    usbClientProvider.SetOsExtendedPropertyHandler = &STM32F4_UsbClient_SetOsExtendedPropertyHandler;

    usbClientApi.Author = "GHI Electronics, LLC";
    usbClientApi.Name = "GHIElectronics.TinyCLR.NativeApis.STM32F4.UsbClientProvider";
    usbClientApi.Type = TinyCLR_Api_Type::UsbClientProvider;
    usbClientApi.Version = 0;
    usbClientApi.Count = 1;
    usbClientApi.Implementation = &usbClientProvider;

    return &usbClientApi;
}
